# Import Required Libraries
import numpy as np

#TODO: Create Interpolate Functions
def interpolate(x, x_points, y_points):
    for i in range(len(x_points)):
        if x_points[i] > x:
            if x_points[i - 1] == x:
                return y_points[i - 1]
            else:
                return y_points[i - 1] + (x - x_points[i - 1]) * ((y_points[i] - y_points[i - 1]) / (x_points[i] - x_points[i - 1]))
    return None

#! Table Data Saturated R22
T = np.array([-30, -28, -26, -24, -22, -20, -18, -16, -14, -12, -10, -8, -6, -4, -2, 0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50])
P = np.array([163.9, 178.2, 193.4, 209.7, 227, 245.3, 264.8, 285.4, 307.3, 330.4, 354.8, 380.5, 407.7, 436.3, 466.4, 498, 531.2, 566.1, 602.6, 640.9, 680.9, 722.9, 766.7, 812.4, 860.2, 910, 961.9, 1016, 1072, 1131, 1131, 1192, 1255, 1321, 1389, 1460, 1534, 1610, 1689, 1770, 1855, 1943])
HF = np.array([165.82, 168.04, 170.27, 172.51, 174.75, 177.00, 179.26, 181.53, 183.81, 186.09, 188.38, 190.69, 193.00, 195.32, 197.66, 200.00, 202.35, 204.72, 207.10, 209.49, 211.89, 214.31, 216.74, 219.18, 221.63, 224.10, 226.59, 229.09, 231.60, 234.14, 236.69, 239.25, 241.84, 244.44, 247.06, 249.71, 252.37, 255.06, 257.77, 260.51, 263.27])
SF = np.array([0.8685, 0.8776, 0.8866, 0.8955, 0.9044, 0.9133, 0.9222, 0.9309, 0.9397, 0.9484, 0.9571, 0.9657, 0.9743, 0.9829, 0.9915, 1.0000, 1.0085, 1.0170, 1.0254, 1.0338, 1.0422, 1.0506, 1.0590, 1.0673, 1.0756, 1.0840, 1.0923, 1.1006, 1.1088, 1.1171, 1.1254, 1.1336, 1.1419, 1.1501, 1.1584, 1.1667, 1.1749, 1.1832, 1.1915, 1.1998, 1.2081])
SG = np.array([1.802, 1.798, 1.794, 1.790, 1.786, 1.783, 1.779, 1.776, 1.772, 1.769, 1.766, 1.763, 1.760, 1.757, 1.754,  1.751, 1.748, 1.745, 1.742, 1.739, 1.737, 1.734, 1.732, 1.729, 1.726, 1.724, 1.721, 1.719, 1.716, 1.714, 1.711, 1.709, 1.706, 1.704, 1.701, 1.698, 1.696, 1.693, 1.691, 1.688, 1.685])

#TODO: Calculate H1 and S1 from P1
print("P1 in range []")
P1 = float(input("Enter Pressure I: "))
H1 = interpolate(P1, P, HF)
#S1 = interpolate(P1, P, SF)
S1 = interpolate(P1, P, SG)
S2 = S1 
print("H1 values = ",round(H1,3))
print("S1 values = ",round(S1,3),"\n")

#TODO: Calculate H2, H3 and S3 from P3
P3 = float(input("Enter Pressure III: "))
H3 = interpolate(P3, P, HF)
S3 = interpolate(P3, P, SF)
P2 = P3
H4 = H3
print("H3 values = ",round(H3,3))
print("S3 values = ",round(S3,3),"\n")

#TODO: Calculate H2 From P2 and S2 Using Superheated R22 Table
#! Create Table Superheated R22
Hsup160 = [392.8, 396.0, 399.1, 402.3, 405.5, 408.8, 412.0, 415.3, 418.5, 421.8, 425.1, 428.5, 431.8, 435.2, 438.6, 442.0, 445.5]
Ssup160 = [1.804, 1.817, 1.830, 1.842, 1.855, 1.867, 1.879, 1.890, 1.902, 1.914, 1.925, 1.936, 1.947, 1.959, 1.970, 1.980, 1.991]
Hsup170 = [0, 395.7, 398.9, 402.1, 405.3, 408.6, 411.8, 415.1, 418.4, 421.7, 425.0, 428.3, 431.7, 435.1, 438.5, 441.9, 445.4]
Ssup170 = [0, 1.810, 1.823, 1.836, 1.848, 1.860, 1.872, 1.884, 1.896, 1.907, 1.919, 1.930, 1.941, 1.952, 1.963, 1.974, 1.985]
Tsup160 = [-30, -25, -20, -15, -10, -5, 0, 5, 10, 15, 20, 25, 30, 35, 40, 45, 50]
Tsup170 = Tsup160

print(len(Hsup160),len(Ssup160),len(Ssup170),len(Hsup170),len(Tsup160))

if P2 == 160:
    H2 = interpolate(S2,Ssup160,Hsup160)
    print(round(H2,3))


#TODO: ตอนแรกใช้ Interpolated HกับS โดยดูSเป็นหลัก
#TODO: คิด H ออกมาช่วงซ้ายกับช่วงขวา
#TODO: หา H โดยการ Interpolated HกับP


#ขั้นตอนแรกสุดให้ดูตาราง หา S => A13 ตามค่า Pressure ที่ได้ หา H => A12 ตามค่า Pressure 